---
kind: enumMember
id: F:Autodesk.Revit.DB.WallSide.Exterior
enum: Autodesk.Revit.DB.WallSide
source: html/91c4f3e9-d268-dfcb-fed4-fcee840ceb3a.htm
---
# Autodesk.Revit.DB.WallSide.Exterior

The exterior of the wall.